In [4]:

import pandas as pd
array = [1, 3, 5, 7, 9, 11]
series_obj = pd.Series(array)
arr = series_obj.values
arr

array([ 1,  3,  5,  7,  9, 11], dtype=int64)

In [5]:
reshaped_arr=arr.reshape((3,2))
reshaped_arr

array([[ 1,  3],
       [ 5,  7],
       [ 9, 11]], dtype=int64)

In [6]:
import pandas as pd
array=["anju","karthikeyu","ramu","abhi","somu","bhavya"]
series_obj=pd.Series(array)
print("Given Series:\n",series_obj)
arr=series_obj.values
arr

Given Series:
 0          anju
1    karthikeyu
2          ramu
3          abhi
4          somu
5        bhavya
dtype: object

array(['anju', 'karthikeyu', 'ramu', 'abhi', 'somu', 'bhavya'],
      dtype=object)

In [8]:
reshaped_arr=arr.reshape((2,3))
print("After Reshaping:\n",reshaped_arr)

After Reshaping:
 [['anju' 'karthikeyu' 'ramu']
 ['abhi' 'somu' 'bhavya']]

In [10]:
df=pd.DataFrame({'A':['vasu','vani','kavya'],
              'B':['masters','graduate','graduate'],
              'C':[24,22,23]})
df

       A         B   C
0   vasu   masters  24
1   vani  graduate  22
2  kavya  graduate  23

In [12]:
df.pivot('A','B','C')

<ipython-input-12-1fdd40662595>:1: FutureWarning: In a future version of pandas all arguments of DataFrame.pivot will be keyword-only.
  df.pivot('A','B','C')

B      graduate  masters
A
kavya      23.0      NaN
vani       22.0      NaN
vasu        NaN     24.0

In [14]:
df.pivot(index='A',columns='B',values=['C','A'])

             C                A
B     graduate masters graduate masters
A
kavya       23     NaN    kavya     NaN
vani        22     NaN     vani     NaN
vasu       NaN      24      NaN    vasu

In [16]:
df=pd.DataFrame({'Name':['kaju','swethasva','ramu','kaya','rani','anju'],
                 'Gender':['male','male','male','female','female','female'],
                 'Age':[32,54,43,76,22,65]})
print("Dataser")
print(df)
print("-"*40)
def age_bucket(age):
    if age<=18:
        return"<18"
    else:
        return">18"
    df['age group']=df['age'].kapplu(age_bucket)
    gender = pd.DataFrame(df.Gender.value_counts(normalize=True)*100).reset_index()
gender.columns = ['Gender', '%Gender']
df = pd.merge(left=df, right=gender, how='inner', on=['Gender'])
# creating pivot table
table = pd.pivot_table(df, index=['Gender', '%Gender', 'Age Group'],
values=['Name'], aggfunc={'Name': 'count',})
# display table
print("Table")
print(table)

Dataser
        Name  Gender  Age
0       kaju    male   32
1  swethasva    male   54
2       ramu    male   43
3       kaya  female   76
4       rani  female   22
5       anju  female   65
----------------------------------------

<class 'NameError'>: name 'gender' is not defined